load/ca-load-test.yml
config:
  target: https://thelist-stage.710labs.com
  phases:
    - duration: 300
      arrivalRate: 1
      maxVusers: 5
      name: Basic Load Test 5 VU
  plugins:
    faker:
      locale: en
  variables:
    firstName: "$faker.name.firstName"
    lastName: "$faker.name.lastName"
  engines:
    playwright:
      contextOtions:
        recordVideo:
          dir: 'outputs/'
      launchOptions:
        headless: false
        # tracesDir: 'outputs/'
  processor: './artillery-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'caWorkflow'