load/ca-load-test.yml
config:
  target: https://thelist-dev.710labs.com
  phases:
    - duration: 5
      arrivalRate: 1
      name: Basic Load Test 5 VU
  engines:
    playwright:
      contextOtions:
        recordVideo:
          dir: 'outputs/'
      launchOptions:
        headless: false
        # tracesDir: 'outputs/'
  processor: './artillery-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'caWorkflow'